---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures
source: html/7dc99703-4924-b16e-7f73-cba16f678c53.htm
---
# BuiltInFailures.CurtainGridFamilyFailures Properties

The mullion(s) you are trying to place is too short for his type, and was not placed on the grid.